
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |           5 |          0 |
## Affected resources by action

|  Action  | Resources                                                              |
|:--------:|:-----------------------------------------------------------------------|
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                       |
|    🟡    | `module.jumphost.aws_iam_policy.required`                              |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                         |
|    🟡    | `module.terraform-aws-github-backup.aws_autoscaling_group.main`        |
|    🟡    | `module.terraform-aws-github-backup.aws_launch_template.github-backup` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "18" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-0615a53b3317b7031" -> "ami-0d3274c4129454aa7"
      ~ latest_version                       = 18 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_autoscaling_group.main will be updated in-place
  ~ resource "aws_autoscaling_group" "main" {
        id                               = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        name                             = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "15" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_launch_template.github-backup will be updated in-place
  ~ resource "aws_launch_template" "github-backup" {
        id                                   = "lt-05453df9000ac85e1"
      ~ instance_type                        = "t3a.micro" -> "t3a.small"
      ~ latest_version                       = 15 -> (known after apply)
        name                                 = "infrahouse-github-backup20241009004627550500000004"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiA1LCAiZGVzdHJveSI6IDB9fQ==
```
</details>